       ctl-opt option(*nodebugio:*srcstmt:*NOUNREF) CCSIDCVT(*LIST);
       ctl-opt dftactgrp(*no) datedit(*ymd);
       ctl-opt bnddir('MIRUS_BND':'SERVICE');
