       dcl-ds inhert based(nihil);
         entire char( 32768);
         chrstr char( 32768) pos(1);
         r_qualified char(10) pos(1);
       end-ds;

